



"""2 створіть словник family в якому по іменах будуть доступні словники для кожного члена сім'ї/родини
(по одному словнику на кожну людину чи домашнього улюбленця)
"""


family = {1: "Дочка" , 2: "Сын" , 3: "Папа" , 4: "Мама"}

family[1] = {1:"Дочка",2:"Любит животных",3:"Работы нет"}

family[2] = {1:"Сын",2:"Любит футбол",3:"Работы нет"}

family[3] = {1:"Папа",2:"Любит футбол",3:"Работы Экономист"}

family[4] = {1:"Мама",2:"Любит готовить кушать",3:"Работы Экономист"}

print(family)

"""з вашого словника family виведіть тільки імена з усіх записів"""

print(family[1])
print(family[2])
print(family[3])
print(family[4])

"""Напишіть скрипт, з допомогою якого користувач може перевірити чи значення(ключ або значення),
є у вашому словнику family і якщо воно є то виведіть словник, в якому це значення зустрічається
"""


family_input = str(input("Ведите кто вы из члена семьи "))

if family_input == "Дочка":
    print(family[1])

elif family_input == "Сын":
    print(family[2])

elif family_input == "Папа":
    print(family[3])

elif family_input == "Мама":
    print(family[4])

else:
    print("Ошибка")


